print ("СПИСКИ !!!!!!!!!!!!!!!!!!!!!!!!!!!")
list_1=[]             # пустой список
list_2=list()         # пустой список
list_3=[1, 2, 3, 8]
print(list_3)
print(*list_3)        # печать списка без скобок и запятых *
for i in list_3:      # в i перебираются элементы списка
    print(i)
print('Длина списка равна',len(list_3))
print(list_3[0])
print(list_3[-1])     # выведет первый с конца. 8
print(list_3[1:3])    # выведет с 1 по 2-й элементы. [2, 3]
print('добавление эл-та в список-----------------')
list_1=[]
for i in range(5):
    list_1.append(i)  # Добавление  элемента в список
print(list_1)         # [0, 1, 2, 3, 4]
print('Удаление последнего элемента-----------------')
list_1=[12,7,-1, 21,0]
print(list_1)         # [12, 7, -1, 21, 0]
print(list_1.pop())   #  удадаляем и печатаем 0
print(list_1)         # [12, 7, -1, 21]
a=list_1.pop()        #  удадаляем 21 и записываем a=21
print(list_1)         # [12, 7, -1]
print(type(a))
print('a=',a)         # a= 21
b=list_1.pop(0)       # удадаляем 0-й элемент=12 и записываем b=12
print('b=',b)         # b= 12
print(list_1)         # [7, -1]
print('Добавление элемента в нужную позицию-----------------')
list1 = [12, 7, -1, 21, 0]
list1.insert(2, 11)   # добавит на 2 место элемент =11
print(list1)          # [12, 7, 11, -1, 21, 0]
print('Срезы списка----------------------------')
list_1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(list_1[0]) # 1
print(list_1[1]) # 2
print(list_1[len(list_1)-1]) # 10
print(list_1[-5]) # 6
print(list_1[:]) # [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(list_1[:2]) # [1, 2]
print(list_1[len(list_1)-2:]) #[9, 10]
print(list_1[2:9]) # [3, 4, 5, 6, 7, 8, 9]
print(list_1[6:-18]) # []
print(list_1[0:len(list_1):6]) # печать от 0 элемента до посл. с шагом 6 _[1, 7]
print(list_1[::6])             # печать от 0 элемента до посл. с шагом 6[1, 7]
print('КОРТЕЖ -это неизменяемый список !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!')
t = () # создание пустого кортежа
print('t=',t,type(t))   # t= () <class 'tuple'>
t = (1,)
print('t=',t,type(t))   # t= (1,) <class 'tuple'> !!! Тип-кортеж
t = (1)
print('t=',t,type(t))   # t= 1 <class 'int'> !!! воспринял как Тип-int 
t = (28, 9, 1990)
print('t=',t, type(t))  # t= (28, 9, 1990) <class 'tuple'>
print('Преобразовать список в кортеж и наоборот---------------------------')
v=[1,8,9]
print('v=',v, type(v))   # v= [1, 8, 9] <class 'list'>
v=tuple(v)               # Преобразовать список в кортеж
print('v=',v, type(v))   # v= (1, 8, 9) <class 'tuple'>
v=list(v)                # Преобразовать список в кортеж
print('v=',v, type(v))   # v= [1, 8, 9] <class 'list'>
print('Множественное присваивание. Распаковка Кортежа, списка---------------------------')
a,b,c=1,2,50
print('a=',a,'b=',b,'c=',c)  # a= 1 b= 2 c= 50
v=[4,5,57]
a,b,c=v                      # присваивание элементов списка v  в переменные a,b,c
print ('v=',v, '; a=',a,'b=',b,'c=',c) # v= [4, 5, 57] ; a= 4 b= 5 c= 57
a=b=c=1
print('a=',a,'b=',b,'c=',c)  # a= 1 b= 1 c= 1
#--------------------------
t = tuple(['red', 'green', 'blue'])
r, g, b = t
print('r:{} g:{} b:{}'.format(r, g, b))# r:red g:green b:blue