# Задача №21. Общее обсуждение
# Напишите программу для печати всех уникальных
# значений в словаре.
# Input: [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"},
# {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII
# ":" S007 "}]
# Output: {'S005', 'S002', 'S007', 'S001', 'S009'}
# Примечание: Список словарей задан изначально.
# Пользователь его не вводит
print('РЕШЕНИЕ СО СЛОВАРЕМ----------------')
slovar={"V": "S001", "V1": "S002", "VI": "S001", "V2": "S005", "VII": "S005", " V ":"S009", "VIII":"S007"}
set1=set()
for i in slovar:
    set1.add(slovar[i])
    #print(slovar[i])
print('set1=',set1)    
print('РЕШЕНИЕ СО СПИСКОМ СЛОВАРЕЙ----------------')
set1=set()
s=[{"V": "S001"}, {"V": "S002"}, {"VI": "S001"},{"VI": "S005"}, {"VII": "S005"}, {" V ":"S009"}, {" VIII":"S007"}]
for i in s:      # Перебираем словари в переменной i
    for j in i:  # Перебираем элементы в словарях, у нас всего 1 элемент
        set1.add(i[j])  # Добавляем в множество значение словаря i
print('set1=',set1)
