# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растет на
# круглой грядке, причем кусты высажены только по окружности. Таким образом, у
# каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них
# выросло различное число ягод – на i-ом кусте выросло ai
#  ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.
# Эта система состоит из управляющего модуля и нескольких собирающих модулей.
# Собирающий модуль за один заход, находясь непосредственно перед некоторым
# кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может
# собрать за один заход собирающий модуль, находясь перед некоторым кустом
# заданной во входном файле грядки.

arr = [5, 8, 600, 4, 9, 2, 7, 100, 100, 200]
# 19
arr2=[]
for i in range(len(arr)-2):
    a=arr[i]+arr[i+1]+arr[i+2]
    arr2.append(a)
a1=arr[-2]+arr[-1]+arr[0]
a2=arr[-1]+arr[0]+arr[1]
arr2.append(a1)
arr2.append(a2)
#print(arr2)
print(max(arr2))